Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: In this lesson, you’ll enable the editing of existing meals.
ja: このレッスンにおいて、あなたは既存の食事の編集を可能にします。

source: In this lesson, you’ll implement a rating control for the FoodTracker app.
ja: このレッスンでは、あなたは格付けコントロールをFoodTrackerアプリに実装します。

source: In this lesson, you’ve familiarized yourself with the contents of an Xcode project, and with many of the tools used to design and run an iOS app.
ja: このレッスンにおいて、あなたはあなた自身をXcodeプロジェクトのコンテンツに、そしてiOSアプリを設計して実行するのに使われる多くのツールに親しませました。

source: In this lesson, you’ve learned about the view controller life cycle methods, and used them to configure your view controller’s content.
ja: このレッスンでは、あなたはいくつかのビューコントローラライフサイクルメソッドについて学びました、そしてそれらを使ってあなたのビューコントローラの持つ内容を構成しました。

source: In this lesson, you’ve used the assistant editor to add outlets and actions to your source code.
ja: このレッスンでは、あなたはアシスタントエディタを使ってアウトレットとアクションをあなたのソースコードに加えました。

source: In this method, add the following code to resign the text field’s first-responder status, and a comment to describe what the code does:
ja: このメソッドにおいて、以下のコードをテキスト欄のファーストレンポンダ状態を破棄するために、そしてひとつのコメントをこのコードが何をするか説明するために加えてください。

source: In this method, add the following line of code:
ja: このメソッドにおいて、以下のコード行を加えてください：

source: In this method, you’ll write the logic to add the new meal (that’s passed from MealViewController, the source view controller) to the meal list data and add a new row to the table view in the meal list scene.
ja: このメソッドにおいて、あなたはロジックを書いて、新しい食事（それはMealViewController、ソースビューコントローラから渡されます）を食事リストデータに加えて、食事リストシーンにおいて新しい行をテーブルビューに加えるようにします。

source: In this pattern, models keep track of your app’s data, views display your user interface and make up the content of an app, and controllers manage your views.
ja: このパターン（類型）において、モデルはあなたのアプリのデータの最新状態を把握し、ビューはあなたのユーザインターフェイスを表示してアプリのコンテンツを作り上げ、そしてコントローラはあなたのビューを管理します。

source: In this section, add another UITextFieldDelegate method:
ja: この節において、もう１つのUITextFieldDelegateメソッドを加えてください：

source: In this step you’ll implement the behavior in the Meal class to save and load the meal.
ja: この段階においてあなたはMealクラスにおいて食事を保存してロードする（読み込む）挙動を実装します。

source: In those cases, consider using the delegate pattern.
ja: それらの場合には、デリゲートパターンを使うことを考えてください。

source: In your case, you’ll take the selected image and display it in your image view.
ja: あなたの場合では、あなたは選択された画像を取得してそれをあなたのイメージビューに表示します。

source: In your case, you’ll take the text that’s in the text field and use it to change the value of your label.
ja: あなたの場合には、あなたはテキスト欄の中にあるテキストをとってそれをあなたのラベルの値を変更するために使います。

source: In your storyboard, find the outline view toggle.
ja: あなたのストーリーボードにおいて、アウトラインビュー切替ボタンを見つけてください。

source: In your storyboard, open the outline view and expand the utility area.
ja: あなたのストーリーボードにおいて、アウトラインビューを開いてユーティリティ区画を展開してください。

source: In your storyboard, select the Cancel button.
ja: あなたのストーリーボードにおいて、Cancelボタンを選択してください。

source: In your storyboard, select the Save button.
ja: あなたのストーリーボードにおいて、Saveボタンを選択してください。

source: In your storyboard, select the Set Default Label Text button.
ja: ストーリーボードにおいて、Set Default Label Textボタンを選択してください。

source: In your storyboard, select the image view in the table view cell.
ja: あなたのストーリーボードにおいて、イメージビューをテーブルビューセルにおいて選択してください。

source: In your storyboard, select the image view.
ja: あなたのストーリーボードにおいて、イメージビューを選択してください。

source: In your storyboard, select the label in the table view cell.
ja: あなたのストーリーボードにおいて、ラベルをテーブルビューセルにおいて選択してください。

source: In your storyboard, select the label.
ja: あなたのストーリーボードにおいて、ラベルを選択してください。

source: In your storyboard, select the rating control in the table view cell.
ja: あなたのストーリーボードにおいて、格付けコントロールをテーブルビューセルにおいて選択してください。

source: In your storyboard, select the text field in the meal scene.
ja: あなたのストーリーボードにおいて、テキスト欄を食事シーンにおいて選択します。

source: In your storyboard, select the text field.
ja: あなたのストーリーボードにおいて、テキスト欄を選択してください。

source: In your storyboard, use the Object library to find a Horizontal Stack View object, and drag one into your storyboard scene so that it’s in the stack view below the image view.
ja: あなたのストーリボードにおいて、オブジェクトライブラリを使うことで、Horizontal Stack Viewオブジェクトを見つけて、それをあなたのストーリーボードシーンへとドラッグしてそれがスタックビューの中でイメージビューの下になるようにしてください。

source: Include UI Tests: Unselected.
ja: UIテストを含む：非選択。

source: Include Unit Tests: Selected.
ja: ユニットテストを含む：選択。

source: Initially, the simulator displays your app’s launch screen, and then it transitions to your app’s main interface.
ja: 初めに、シミュレータはあなたのアプリの起動画面を表示します、それからそれはあなたのアプリのメインインターフェイスへ移行します。

source: Inside the for-in loop, add the following code just after the line that sets the button’s isSelected property.
ja: for-inループの内側で、以下のコードを、ボタンのisSelectedプロパティを設定した行の直ぐ下に加えてください。

source: Inside the for-in loop, just after the constraints, add the following code:
ja: for-inループの内側で、制約のすぐ下に、以下のコードを加えてください：

source: Instead of creating new cells and deleting old cells as the user scrolls, the table tries to reuse the cells when possible.
ja: ユーザがスクロールするにつれて新しいセルを作成して古いセルを削除する代わりに、テーブルは可能な場合にはセルを再利用しようとします。

source: Instead of creating one button, the loop will create five.
ja: １つのボタンを作成するのではなく、このループは５つ作成します。

source: Instead of deleting the existing segue and creating a new one, simply change the segue’s style in the Attributes inspector.
ja: 既存のセグエを削除して新しいものを作成するのではなく、単にそのセグエの形式をAttributesインスペクタにおいて変更してください。

source: Instead of the meal detail scene with its text field, image view, and rating control, you should now see an empty table view—a screen with a number of horizontal dividers to separate it into rows, but with no content in each row.
ja: 食事詳細シーンとそれが持つそれのテキスト欄、イメージビュー、そして格付けコントロールではなく、あなたは今では空のテーブルビューを見るはずです—それは、画面をいくつかの水平仕切りで行へとそれを分けています、しかし各行は空です。

source: Instead, it adds a new meal.
ja: そうしないで、それは新しい食事を加えます。

source: Instead, it is lazily created the first time the system or any code accesses the controller’s view property.
ja: そうではなくて、それは遅延に、システムまたは何らかのコードがコントローラの持つviewプロパティにアクセスする最初の時に、作成されます。

source: Instead, replace it with a series of checks.
ja: 代わりに、それを一連の確認と入れ替えます。

source: Instead, tapping anywhere in the cell should select the cell.
ja: 代わりに、セルのどこか他をタップしてそのセルを選択すべきです。

source: Interface Builder
ja: インターフェイスビルダー

source: Interface Builder can do more than just display your custom view.
ja: Interface Builderは、あなたのカスタムビューを表示するだけでなくもっと多くを行うことができます。

source: Interface Builder does not know anything about the contents of your rating control.
ja: Interface Builderは、あなたの格付けコントロールの内容について何も知りません。

source: Interface Builder supports the inspection of basic types (and their corresponding optionals), including: Booleans, numbers, strings, as well as CGRect, CGSize, CGPoint, and UIColor.
ja: Interface Builderは、基本的な型（およびそれらの関連するオプショナル）の調査をサポートします、含むのは：ブール、数、文字列、それだけでなくCGRect、CGSize、CGPoint、そしてUIColor。

source: It becomes red when it is selected.
ja: それが赤くなったらそれが選択されたということです。

source: It creates the entry point to your app and a run loop that delivers input events to your app.
ja: それは、あなたのアプリに対するエントリポイントと、あなたのアプリに入力イベントを送り届ける実行ループを作成します。

source: It defines your AppDelegate class.
ja: それはあなたのAppDelegateクラスを定義します。

source: It includes both a table view and the controller that manages the table view.
ja: それは、テーブルビューと、テーブルビューを管理するコントローラの両方を含みます。

source: It is very common to make a view controller the delegate for objects that it manages.
ja: 一番ありふれているのは、ビューコントローラをそれが管理するオブジェクトのためのデリゲートにすることです。

source: It is where all of your app content is drawn.
ja: それはあなたのアプリのコンテンツの全てが描画されるところです。

source: It lets you edit the properties of an object in your storyboard.
ja: それはあなたにあなたのストーリーボードのオブジェクトのプロパティを編集させます。

source: It lets you edit the size and position of an object in your storyboard.
ja: それは、あなたにあなたのストーリーボードの中のオブジェクトの大きさと位置を編集させます。

source: It makes sense to have the meal list be the first thing users see when they launch your app, so tell Xcode that’s your intent by setting the table view controller as the first scene.
ja: 食事リストがあなたのアプリを起動した時にユーザが見る最初のものであるのは道理にかなっています、それでXcodeにそれがあなたの意向であることを、テーブルビューコントローラを最初のシーンとして設定することによって伝えます。

source: It may also contain an edited version of that image, if one exists.
ja: それはまたその画像の編集されたバージョンを含むかもしれません、それが存在するならば。

source: It may take a few moments to start up the first time.
ja: それは初めての始動では少し時間がかかるかもしれません。

source: It needs to save its data by assigning the value of each property to a particular key.
ja: それは、それのデータの保存を、各プロパティの値を特有のキーに割り当てることによって行う必要があります。

source: It organizes all the files and resources that go into creating an app.
ja: それは、アプリの作成に従事するすべてのファイルとリソースを組織化します。

source: It provides editors for both your code and your user interfaces.
ja: それは、あなたのコードとあなたのユーザインターフェイス両方のためのエディタを提供します。

source: It replaces the old meal object with the new, edited meal object.
ja: それは、古いmealオブジェクトを新しいもので置き換えて、mealオブジェクトを編集します。

source: It safely unwraps the optional returned by the dictionary and casts it as a UIImage object.
ja: それはディクショナリによって返されるオプショナルを安全にアンラップして、それをUIImageオブジェクトとしてキャストします。

source: It should build without errors.
ja: それはエラーなしてビルドするはずです。

source: It should build without issues.
ja: それは問題なくビルドするはずです。

source: It should look like this:
ja: それはこのように見えるはずです：

source: It shows all the available unwind action methods.
ja: それはすべての利用可能な巻き戻しアクションメソッドを表示します。

source: It then adds this button to the left side of the navigation bar in the meal list scene.
ja: それはそれからこのボタンを食事リストシーンにおいてナビゲーションバーの左側に加えます。

source: It then executes an appropriate block of code, based on the first pattern that matches successfully.
ja: それはそれから、成功裏にマッチする最初のパターンに基づいて、適切なコードのブロックを実行します。

source: It then loads the data by looking up the information associated with that key.
ja: それはそれから、データのロードを、そのキーに結びついた情報を検索することによって行います。

source: It uses the constant Meal.ArchiveURL that you defined in the Meal class to identify where to save the information.
ja: それは、定数Meal.ArchiveURLを使います、それはあなたがMealクラスにおいて定義した情報を保存するところを識別するためのものです。

source: It’ll be a good way to test that the text field is taking the user input and processing it appropriately.
ja: テキスト欄がユーザの入力を受け取っていることと適切にそれを処理していることをテストするためにこれは良い方法となります。

source: It’s best to give your test cases descriptive names.
ja: それは、あなたのテストケースに説明的な名前を与えるのに最良です。

source: It’s good to understand how the elements you’ve added are actually arranged in the scene.
ja: あなたが加えた要素がどのように実際にシーンに配置されたかを理解するのは良いことです。

source: It’s important to understand a template’s uses before you extend it to make your own app.
ja: あるひな形の用途を、独自アプリ作成のためにあなたがそれを拡張する前に理解することは大切です。

source: It’s important to understand the relationship that a storyboard has to the code you write.
ja: 大切なのは、この関係を理解することです、それはストーリーボードがあなたが書くコードに対して持つ関係です。

source: It’s important to understand when the system calls these methods, so you can set up or tear down the views you’re displaying at the appropriate step in the process—something you’ll need to do later in the lessons.
ja: 重要なことは、システムがそれらのメソッドをいつ呼び出すか理解することです、そうすればあなたはあなたが表示しているビューの準備や解体がこの一連の過程の適切な段階でできます—それはあなたが後にこのレッスンでする必要があることです。

source: It’s most efficient for table views to ask for only the cells for rows that are being displayed, and that’s what tableView(_:cellForRowAt:) allows the table view to do.
ja: テーブルビューにとって最も効率が良いのは、表示されている行のためのセルだけを要求することです、そしてそれはtableView(_:cellForRowAt:)がテーブルビューに可能にすることです。

source: It’s time to build a basic interface.
ja: 基本インターフェイスを作る時です。

source: Jump Right In
ja: すぐ始めよう

source: Just above the // Add the button to the stack comment, add the following code:
ja: // Add the button to the stackコメントのすぐ上に、以下のコードを加えてください：

source: Just implement the ones you need to get the behaviors you desire.
ja: ただあなたが必要とするものだけを実装して、あなたが望む挙動を得てください。

source: Just log a simple debug message to the console.
ja: 単に簡単なデバッグメッセージをコンソールに記録してください。

source: Just use the menu item in the next step to create the project.
ja: 単にそのメニュー項目を次のステップでプロジェクトを作成するのに使ってください。

source: Language: Swift
ja: 言語：Swift

source: Later, you’ll create an action to reset the label text to a default value.
ja: 後で、あなたは、ラベルテキストを省略時の値に設定し直す、あるアクションを作成します。

source: Later, you’ll link these buttons to actions.
ja: 後で、あなたはこれらのボタンをアクションと結び付けます。

source: Later, you’ll use this identifier to identify the segue.
ja: 後で、あなたはこの識別子をセグエを識別するのに使用します。

source: Layout bugs occur when the system resizes a view so that it’s either larger or smaller than you anticipate.
ja: レイアウトの欠陥は、システムがあるビューの大きさを変更するときに現れます、それゆえそれはあなたが予想するより大きいか小さいかのどちらかになります。

source: Layout guides are visible only when you drag or resize objects next to them; they disappear when you let go of the text field.
ja: レイアウトガイドは、あなたがオブジェクトをドラッグやリサイズするときにのみ見えます。

source: Learning Objectives
ja: 学習する目標

source: Leave that as is.
ja: それはそのままにします。

source: Leave the rest of the options as they are, and click Connect.
ja: 残りのオプションはそれらのままにしておき、Connectをクリックします。

source: Leave the rest of the options as they are.
ja: 残りのオプションはそれらのままにしておきます。

source: Leave these defaults as they are, and click Create.
ja: これらの初期値はそれらのままにしておきます、そしてCreateをクリックします。

source: Let’s get started!
ja: さあ始めましょう！

source: Like other view objects, it must be added as a subview to an existing scene.
ja: 他のビューオブジェクトのように、それはサブビューとして既存のシーンに加えられなければなりません。

source: Like the print() function, the unified logging system lets you send messages to the console.
ja: print()関数のように、統合ログシステムはあなたにメッセージをコンソールへと送らせます。

source: Load Initial Data
ja: 初期データのロード

source: Locate the setupButtons() method, and make the following changes:
ja: setupButtons()メソッドの位置を突き止めて、以下の変更をしてください：

source: Log messages to the console to indicate the result.
ja: メッセージをコンソールに記録して結果を示してください。

source: Look at the outline view to see which user interface elements have been added to your scene.
ja: アウトラインビュー（外観図）で見て、どんなユーザインターフェイス要素があなたのシーンに加えられたか確かめてください。

source: MVC is central to a good design for any iOS app, and so far, the FoodTracker app has been built along MVC principles.
ja: MVCは、iOSアプリのための良い設計として中心的なものです。

source: Make a class conform to a protocol
ja: クラスをプロトコルに準拠させる

source: Make sure the Custom checkbox next to this field is selected:
ja: この欄の隣のCustomチェックボックスが選択されることを確かめてください：

source: Make sure the Language option is set to Swift.
ja: LanguageオプションがSwiftに設定されていることを確かめてください。

source: Make sure the button is added, regardless of which initializer is called.
ja: ボタンが加えられることを確認してください、どのイニシャライザが呼ばれるかに構わずに。

source: Make sure the lines in the for-in loop are indented properly by selecting all of them and pressing Control-I.
ja: for-inループの中の行が、それらの全てを選択してコントロール-Iを押すことによってふさわしく字下げされることを確かめてください。

source: Make sure the lines in the else clause are indented properly by selecting all of them and pressing Control-I.
ja: else節の中の行が適切に字下げされることをそれらのすべてを選択してコントロール-Iを押すことによって確認してください。

source: Make sure the names of the images in your project match the names you write in this code.
ja: あなたのプロジェクトにおける画像の名前があなたがこのコードに書いた名前と合致することを確かめてください。

source: Make sure the project navigator is open in the navigator area.
ja: プロジェクトナビゲータ（案内機能）がナビゲータ区画で開いていることを確認してください。

source: Make sure the text field is still selected.
ja: テキスト欄がまだ選択されていることを確かめてください。

source: Make sure the “Also create XIB file” option is unselected.
ja: 「Also create XIB file」オプションが選択されないことを確かめてください。

source: Make sure this line of code is inside of the outer if statement.
ja: このコード行がその外側のif文の内側にあるようにしてください。

source: Make sure you select the iPhone 7 Simulator, not an iOS device.
ja: あなたが、iOSデバイスではなく、iPhone 7シミュレータを選択するのを確かめてください。

source: Making sure your layout is robust and extensible from the start ensures that you have a solid foundation to build upon.
ja: あなたのレイアウトががっしりして拡張可能であるのをその始まりから確かにすることは、あなたがその上に構築するための強固な基盤を持つことを保証します。

source: Many UIView subclasses are highly specialized in appearance and behavior.
ja: 多くのUIViewサブクラスは、外観と挙動において高度に特殊化されます。

source: Many views and controls have transparent backgrounds, making it difficult to see their actual size.
ja: 多くのビューとコントロールは、透明な背景を持ち、それがそれらの実際の大きさを知るのを難しくしています。

source: Model-View-Controller (MVC)
ja: モデル-ビュー-コントローラ（MVC）

source: Most of these templates have preconfigured interface and source code files.
ja: これらのひな形のほとんどは、あらかじめ構成されたインターフェイスとソースコード・ファイルを持ちます。

source: Navigate to the updateButtonSelectionStates() method.
ja: updateButtonSelectionStates()メソッドに進んでください。

source: Navigation bars get their title from the view controller at the top of the navigation stack—they don’t have a title themselves.
ja: これらナビゲーションバーはそれらのタイトルを、ナビゲーションスタックの最上部でのビューコントローラから得ます — それらは自身ではタイトルを持ちません。

source: New document that provides a hands-on introduction to iOS app development using Swift.
ja: 実践入門書をSwift使用のiOSアプリ開発に提供する新しい文書。

source: Next lesson, you’ll add the ability to navigate between the table and the meal view.
ja: 次のレッスンでは、あなたはテーブルと食事ビューの間を進んでいく能力を加えることになります。

source: Next, add a label (UILabel) at the top of the scene.
ja: 次に、ラベル（UILabel）をこのシーンの一番上に加えます。

source: Next, configure the navigation bar to add a title to this scene as well as two buttons, Cancel and Save.
ja: 次に、ナビゲーションバーを構成設定して、このシーンにタイトルを、それだけでなく２つのボタン、CancelとSaveを加えてください。

source: Next, find the field labeled Interaction and deselect the User Interaction Enabled checkbox.
ja: 次に、Interactionと名前を付けられるフィールドを探して、User Interaction Enabledチェックボックスを選択解除してください。

source: Next, the code above sets the filled image for the selected state.
ja: 次に、上のコードは塗りつぶされた画像を選択済状態に対して設定します。

source: Next, the code removes the button from the stack view entirely.
ja: 次に、コードはボタンをスタックビューから完全に削除します。

source: Next, write the code to set the appropriate image for a button at the right time.
ja: 次に、コードを書いて適切な画像をボタンに対して正しいときに設定するようにします。

source: Next, you calculate the value based on the control’s rating.
ja: 次に、あなたは値をコントロールの持つ格付けに基づいて計算します。

source: Next, you need a persistent path on the file system where data will be saved and loaded, so you know where to look for it.
ja: 次に、あなたはファイルシステム上の永続パス、そこにおいてデータ化保存されロードされるところを必要とします、それであなたはどこでそれを捜すかがわかります。

source: Next, you need to add a few sample images to your project.
ja: 次に、あなたが必要とするのは、いくつかの見本画像をあなたのプロジェクトに加えることです。

source: Next, you need to add buttons to your view to allow the user to select a rating.
ja: 次に、あなたが必要とするのは、ボタンをあなたのビューに加えてユーザが格付けを選べるようにすることです。

source: Next, you will design and connect the app’s data model.
ja: 次に、あなたはアプリのデータモデルの設計および接続をすることになります。

source: Next, you’ll add a button to this navigation bar to transition to the meal detail scene.
ja: 次に、あなたは、あるボタンをこのナビゲーションバーに加えて、食事詳細シーンに場面転換するようにします。

source: Next, you’ll add images of an empty, filled, and highlighted star to the buttons.
ja: 今度は、あなたは空の、塗りつぶされた、そして強調された星の画像をボタンに加えます。

source: Next, you’ll give users the ability to delete a meal from the meal list.
ja: 次に、あなたは食事リストからある食事を削除する能力をユーザに与えます。

source: Note
ja: 注意

source: Note that because you’re not using Interface Builder, you don’t need to define your action method with the IBAction attribute; you just define the action like any other method.
ja: 注意することは、あなたがインターフェイスビルダーを使っていないことです、あなたがしなくていもいいのは、あなたのアクションメソッドをIBAction属性とともに定義することです；あなたは単にこのアクションをあらゆる 他のメソッドと同じように定義します。

source: Note that the assets catalog is located in the app’s main bundle.
ja: アセットカタログはアプリの持つメインバンドルの中にロードされることに注意してください。

source: Note that the code uses the @testable attribute when importing your app.
ja: 注意してください、コードは@testable属性をあなたのアプリをインポートするときに使います。

source: Note that the window property is an optional, which means it may have no value (be nil) at some point.
ja: windowプロパティがオプショナルであることに注意してください、そのことは、それがある時点で値を持たない（nil）かもしれないことを意味します。

source: Note that this causes the app to terminate if the variable’s value has not yet been set.
ja: その変数の値がまだ設定されていないならばこれはアプリの終了を引き起こすことに注意してください。

source: Note that this still does not dismiss the scene when the user is editing a meal.
ja: 注意してください、これはまだ、ユーザが食事を編集している時にシーンを退去させません。

source: Note that this won’t save the model data.
ja: 注意してください、これはモデルデータを保存しません。

source: Note, clicking any of the buttons at this point should still call the ratingButtonTapped(button:) method and log the message to the console.
ja: 注意してください、何らかのボタンをこの時点でクリックすることはまだratingButtonTapped(button:)メソッドを呼び出さず、コンソールにメッセージを記録します。

source: Note, the compiler should complain with an error stating, “Only failable initializers can return ‘nil’.”
ja: 注意してください、コンパイラはエラー、「Only failable initializers can return ‘nil’」を公表して抗議します。

source: Note: At this point, you may see an Xcode warning related to the fact that there’s no way to reach the View Controller scene in the app.
ja: 注意：この時点で、あなたはView Controllerシーンに到達する方法がアプリには無いという事実に関連してXcodeが警告するのを見るでしょう。

source: Note: Unlike when you pushed a scene onto the navigation stack in the last lesson, the system does not automatically provide a back button.
ja: 注意：あなたが最後のレッスンにおいてシーンをナビゲータースタック上へとプッシュした時と違い、システムは自動的に戻るボタンを提供しません。

source: Notice how the stack view lays out the buttons.
ja: どのようにスタックビューがボタンを配置するかにしてください。

source: Notice how the text field grows and shrinks to the appropriate size depending on the device’s orientation and screen size.
ja: どのようにテキスト欄が伸びたり縮んだりしてデバイスの方向や画面サイズ次第で適切な大きさになるかに注意してください。

source: Notice that Xcode automatically opens the Test navigator on the left, and highlights the test that failed.
ja: Xcodeが自動的にTestナビゲータを左で開いて、失敗したテストを強調することに目を留めてください。

source: Notice that the canvas now correctly sizes and places your RatingControl view.
ja: キャンバスが今では正確にあなたのRatingControlビューの大きさと場所を決めることに注意してください。

source: Notice that you didn’t have to specify the type of Default Text, because Swift’s type inference can see that you’re assigning to something of type String and can infer the type correctly.
ja: 注意することは、あなたが「Default Text」の型を指定する必要がなかったことです、なぜならSwiftの型推論はあなたが型Stringの何かを割り当てているのを知ることができ、そして型を正確に推測できるからです。

source: Notice the nil coalescing operator (??) in the name line.
ja: nil合体演算子（??）をname行において注目してください。

source: Notice there’s an Edit button on the left of the table view’s navigation bar.
ja: Editボタンがテーブルビューのナビケーションバーの左にあることに注目してください。

source: Now add a test case where the Meal class’s initialization should fail.
ja: 次にあるテスト項目を加えてください、そこではMealクラスの初期化が失敗するはずです。

source: Now add a test that will fail.
ja: 今度は失敗するテストを加えます。

source: Now add tests to the test case that calls the initializer with invalid parameters.
ja: 幾つかのテストをこのテスト項目に加えます、それはイニシャライザを無効なパラメータで呼び出します。

source: Now call this method from both initialization methods, as shown below:
ja: 次にこのメソッドを両方の初期化メソッドから呼び出してください、下で示すように：

source: Now it’s time to create another scene that shows the entire list of meals.
ja: 今やもう一つのシーンを作成する時です、それは食事のリスト全体を表示します。

source: Now it’s time to think about what pieces of information the RatingControl class needs to have in order to represent a rating.
ja: 今やRatingControlクラスが格付けを表すために持つ必要がある情報の部品は何かについて考える時です。

source: Now that Meal is a subclass of NSObject, the Meal class’s initializer must call one of the NSObject class’s designated initializers.
ja: MealがNSObjectのサブクラスである今、MealクラスのイニシャライザはNSObjectクラスの指定イニシャライザのうちの１つを呼び出さなければなりません。

source: Now that meals are saved at the appropriate times, make sure that meals get loaded at the appropriate time.
ja: 今や食事は適切な時に保存されるので、食事が適切な時にロードされるのを確実なものにしてください。

source: Now that the FoodTracker app is implementing more advanced behavior and a different user interface than in the previous lessons, you’ll want to remove the pieces you don’t need.
ja: 今ではFoodTrackerアプリは以前のレッスンに比べてより進んだ挙動と異なるユーザインターフェイスを実装しています、あなたは必要としない部分を取り除きたいでしょう。

source: Now that you can save and load an individual meal, you need to save and load the meal list whenever a user adds, edits, or removes a meal.
ja: あなたがここの食事を保存してロード（読み込み）できる今、あなたは、ユーザが食事を追加、編集、削除するたびに、食事リストを保存したりロードする必要があります。

source: Now that you have the logic implemented, open MealViewController.swift and make sure the user interface (UI) updates correctly.
ja: あなたがロジックを実装した今では、あなたが必要とするのはMealViewController.swiftを開いて、ユーザインターフェイス (UI)が正しく更新されるよう手配することです。

source: Now when you click the Add button (+) and click Cancel instead of Save, you should navigate back to the meal list without adding a new meal.
ja: 今ではあなたがAddボタン（+）をクリックしてCancelボタンをSaveボタンの代わりにクリックした時、あなたは新しい食事を追加することなく食事リストに導かれて戻ります。
